ErichStyger/mcuoneclipse/Examples/MCUXpresso/LPC55S16-EVK/LPC55S16_Blinky_RAM/device/periph2/PERI_FLASH_NMPA.h
/*
** ###################################################################
**     Processors:          LPC5512JBD100
**                          LPC5512JBD64
**                          LPC5514JBD100
**                          LPC5514JBD64
**                          LPC5514JEV59
**                          LPC5516JBD100
**                          LPC5516JBD64
**                          LPC5516JEV59
**                          LPC5516JEV98
**                          LPC55S14JBD100
**                          LPC55S14JBD64
**                          LPC55S14JEV59
**                          LPC55S16JBD100
**                          LPC55S16JBD64
**                          LPC55S16JEV59
**                          LPC55S16JEV98
**
**     Version:             rev. 1.1, 2019-12-03
**     Build:               b240704
**
**     Abstract:
**         CMSIS Peripheral Access Layer for FLASH_NMPA
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2024 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2018-08-22)
**         Initial version based on v0.2UM
**     - rev. 1.1 (2019-12-03)
**         Initial version based on v0.6UM
**
** ###################################################################
*/

/*!
 * @file FLASH_NMPA.h
 * @version 1.1
 * @date 2019-12-03
 * @brief CMSIS Peripheral Access Layer for FLASH_NMPA
 *
 * CMSIS Peripheral Access Layer for FLASH_NMPA
 */

#if !defined(FLASH_NMPA_H_)
#define FLASH_NMPA_H_                            /**< Symbol preventing repeated inclusion */

#if (defined(CPU_LPC5512JBD100) || defined(CPU_LPC5512JBD64))
#include "LPC5512_COMMON.h"
#elif (defined(CPU_LPC5514JBD100) || defined(CPU_LPC5514JBD64) || defined(CPU_LPC5514JEV59))
#include "LPC5514_COMMON.h"
#elif (defined(CPU_LPC5516JBD100) || defined(CPU_LPC5516JBD64) || defined(CPU_LPC5516JEV59) || defined(CPU_LPC5516JEV98))
#include "LPC5516_COMMON.h"
#elif (defined(CPU_LPC55S14JBD100) || defined(CPU_LPC55S14JBD64) || defined(CPU_LPC55S14JEV59))
#include "LPC55S14_COMMON.h"
#elif (defined(CPU_LPC55S16JBD100) || defined(CPU_LPC55S16JBD64) || defined(CPU_LPC55S16JEV59) || defined(CPU_LPC55S16JEV98))
#include "LPC55S16_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- FLASH_NMPA Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FLASH_NMPA_Peripheral_Access_Layer FLASH_NMPA Peripheral Access Layer
 * @{
 */

/** FLASH_NMPA - Size of Registers Arrays */
#define FLASH_NMPA_GPO0_GPO0_ARRAY_GPO0_ARRAY_COUNT 4u
#define FLASH_NMPA_GPO1_GPO1_ARRAY_GPO1_ARRAY_COUNT 4u
#define FLASH_NMPA_GPO2_GPO2_ARRAY_GPO2_ARRAY_COUNT 4u
#define FLASH_NMPA_GPO3_GPO3_ARRAY_GPO3_ARRAY_COUNT 4u
#define FLASH_NMPA_GPO_CHECKSUM_GPO_CHECKSUM_ARRAY_GPO_CHECKSUM_ARRAY_COUNT 4u
#define FLASH_NMPA_FINAL_TEST_BATCH_ID_FINAL_TEST_BATCH_ID_ARRAY_FINAL_TEST_BATCH_ID_ARRAY_COUNT 4u
#define FLASH_NMPA_UUID_UUID_ARRAY_UUID_ARRAY_COUNT 4u
#define FLASH_NMPA_DCDC_POWER_PROFILE_HIGH_DCDC_POWER_PROFILE_HIGH_ARRAY_DCDC_POWER_PROFILE_HIGH_ARRAY_COUNT 2u
#define FLASH_NMPA_DCDC_POWER_PROFILE_LOW_DCDC_POWER_PROFILE_LOW_ARRAY_DCDC_POWER_PROFILE_LOW_ARRAY_COUNT 2u
#define FLASH_NMPA_DCDC_POWER_PROFILE_MEDIUM_DCDC_POWER_PROFILE_MEDIUM_ARRAY_DCDC_POWER_PROFILE_MEDIUM_ARRAY_COUNT 2u
#define FLASH_NMPA_AUX_BIAS_CURVE_AMBIENT_AUX_BIAS_CURVE_AMBIENT_ARRAY_AUX_BIAS_CURVE_AMBIENT_ARRAY_COUNT 4u
#define FLASH_NMPA_AUX_BIAS_CURVE_TEMP_AUX_BIAS_CURVE_TEMP_ARRAY_AUX_BIAS_CURVE_TEMP_ARRAY_COUNT 4u
#define FLASH_NMPA_PVT_MONITOR_0_PVT_MONITOR_0_ARRAY_PVT_MONITOR_0_ARRAY_COUNT 3u
#define FLASH_NMPA_PVT_MONITOR_1_PVT_MONITOR_1_ARRAY_PVT_MONITOR_1_ARRAY_COUNT 3u
#define FLASH_NMPA_NXP_DEVICE_PRIVATE_KEY_COUNT   13u
#define FLASH_NMPA_NXP_DEVICE_CERTIFICATE_0_COUNT 4u
#define FLASH_NMPA_NXP_DEVICE_CERTIFICATE_1_COUNT 4u
#define FLASH_NMPA_NXP_DEVICE_CERTIFICATE_2_COUNT 4u
#define FLASH_NMPA_NXP_DEVICE_CERTIFICATE_3_COUNT 4u
#define FLASH_NMPA_SHA256_DIGEST_COUNT            8u
#define FLASH_NMPA_ECID_BACKUP_ECID_BACKUP_ARRAY_ECID_BACKUP_ARRAY_COUNT 4u
#define FLASH_NMPA_CHECKSUM_COUNT                 4u

/** FLASH_NMPA - Register Layout Typedef */
typedef struct {
  union {                                          /* offset: 0x0 */
    struct {                                         /* offset: 0x0 */
      __IO uint32_t GPO0_0;                            /**< GPO0 register 0 description, offset: 0x0 */
      __IO uint32_t GPO0_1;                            /**< GPO0 register 1 description, offset: 0x4 */
      __IO uint32_t GPO0_2;                            /**< GPO0 register 2 description, offset: 0x8 */
      __IO uint32_t GPO0_3;                            /**< GPO0 register 3 description, offset: 0xC */
    } GPO0;
    __IO uint32_t GPO0_ARRAY[FLASH_NMPA_GPO0_GPO0_ARRAY_GPO0_ARRAY_COUNT];   /**< GPO0 array description, array offset: 0x0, array step: 0x4 */
  };
  union {                                          /* offset: 0x10 */
    struct {                                         /* offset: 0x10 */
      __IO uint32_t GPO1_0;                            /**< GPO1 register 0 description, offset: 0x10 */
      __IO uint32_t GPO1_1;                            /**< GPO1 register 1 description, offset: 0x14 */
      __IO uint32_t GPO1_2;                            /**< GPO1 register 2 description, offset: 0x18 */
      __IO uint32_t GPO1_3;                            /**< GPO1 register 3 description, offset: 0x1C */
    } GPO1;
    __IO uint32_t GPO1_ARRAY[FLASH_NMPA_GPO1_GPO1_ARRAY_GPO1_ARRAY_COUNT];   /**< GPO1 array description, array offset: 0x10, array step: 0x4 */
  };
  union {                                          /* offset: 0x20 */
    struct {                                         /* offset: 0x20 */
      __IO uint32_t GPO2_0;                            /**< GPO2 register 0 description, offset: 0x20 */
      __IO uint32_t GPO2_1;                            /**< GPO2 register 1 description, offset: 0x24 */
      __IO uint32_t GPO2_2;                            /**< GPO2 register 2 description, offset: 0x28 */
      __IO uint32_t GPO2_3;                            /**< GPO2 register 3 description, offset: 0x2C */
    } GPO2;
    __IO uint32_t GPO2_ARRAY[FLASH_NMPA_GPO2_GPO2_ARRAY_GPO2_ARRAY_COUNT];   /**< GPO2 array description, array offset: 0x20, array step: 0x4 */
  };
  union {                                          /* offset: 0x30 */
    struct {                                         /* offset: 0x30 */
      __IO uint32_t GPO3_0;                            /**< GPO3 register 0 description, offset: 0x30 */
      __IO uint32_t GPO3_1;                            /**< GPO3 register 1 description, offset: 0x34 */
      __IO uint32_t GPO3_2;                            /**< GPO3 register 2 description, offset: 0x38 */
      __IO uint32_t GPO3_3;                            /**< GPO3 register 3 description, offset: 0x3C */
    } GPO3;
    __IO uint32_t GPO3_ARRAY[FLASH_NMPA_GPO3_GPO3_ARRAY_GPO3_ARRAY_COUNT];   /**< GPO3 array description, array offset: 0x30, array step: 0x4 */
  };
  union {                                          /* offset: 0x40 */
    struct {                                         /* offset: 0x40 */
      __IO uint32_t GPO_CHECKSUM_0;                    /**< checksum of the GPO data in words 0, offset: 0x40 */
      __IO uint32_t GPO_CHECKSUM_1;                    /**< checksum of the GPO data in words 1, offset: 0x44 */
      __IO uint32_t GPO_CHECKSUM_2;                    /**< checksum of the GPO data in words 2, offset: 0x48 */
      __IO uint32_t GPO_CHECKSUM_3;                    /**< checksum of the GPO data in words 3, offset: 0x4C */
    } GPO_CHECKSUM;
    __IO uint32_t GPO_CHECKSUM_ARRAY[FLASH_NMPA_GPO_CHECKSUM_GPO_CHECKSUM_ARRAY_GPO_CHECKSUM_ARRAY_COUNT];   /**< checksum of the GPO data in words [3:0], array offset: 0x40, array step: 0x4 */
  };
  union {                                          /* offset: 0x50 */
    struct {                                         /* offset: 0x50 */
      __IO uint32_t FINAL_TEST_BATCH_ID_0;             /**< offset: 0x50 */
      __IO uint32_t FINAL_TEST_BATCH_ID_1;             /**< offset: 0x54 */
      __IO uint32_t FINAL_TEST_BATCH_ID_2;             /**< offset: 0x58 */
      __IO uint32_t FINAL_TEST_BATCH_ID_3;             /**< offset: 0x5C */
    } FINAL_TEST_BATCH_ID;
    __IO uint32_t FINAL_TEST_BATCH_ID_ARRAY[FLASH_NMPA_FINAL_TEST_BATCH_ID_FINAL_TEST_BATCH_ID_ARRAY_FINAL_TEST_BATCH_ID_ARRAY_COUNT];   /**< array offset: 0x50, array step: 0x4 */
  };
  __IO uint32_t DEVICE_TYPE;                       /**< offset: 0x60 */
  __IO uint32_t FINAL_TEST_PROGRAM_VERSION;        /**< offset: 0x64 */
  __IO uint32_t FINAL_TEST_DATE;                   /**< offset: 0x68 */
  __IO uint32_t FINAL_TEST_TIME;                   /**< offset: 0x6C */
  union {                                          /* offset: 0x70 */
    struct {                                         /* offset: 0x70 */
      __IO uint32_t UUID_0;                            /**< offset: 0x70 */
      __IO uint32_t UUID_1;                            /**< offset: 0x74 */
      __IO uint32_t UUID_2;                            /**< offset: 0x78 */
      __IO uint32_t UUID_3;                            /**< offset: 0x7C */
    } UUID;
    __IO uint32_t UUID_ARRAY[FLASH_NMPA_UUID_UUID_ARRAY_UUID_ARRAY_COUNT];   /**< array offset: 0x70, array step: 0x4 */
  };
  __IO uint32_t WAFER_TEST1_PROGRAM_VERSION;       /**< offset: 0x80 */
  __IO uint32_t WAFER_TEST1_DATE;                  /**< offset: 0x84 */
  __IO uint32_t WAFER_TEST1_TIME;                  /**< offset: 0x88 */
       uint8_t RESERVED_0[4];
  __IO uint32_t WAFER_TEST2_PROGRAM_VERSION;       /**< offset: 0x90 */
  __IO uint32_t WAFER_TEST2_DATE;                  /**< offset: 0x94 */
  __IO uint32_t WAFER_TEST2_TIME;                  /**< offset: 0x98 */
  __IO uint32_t USBCFG;                            /**< offset: 0x9C */
  __IO uint32_t PERIPHENCFG;                       /**< offset: 0xA0 */
  __IO uint32_t RAMSIZECFG;                        /**< offset: 0xA4 */
  __IO uint32_t FLASHSIZECFG;                      /**< offset: 0xA8 */
       uint8_t RESERVED_1[4];
  __IO uint32_t RINGO_0;                           /**< offset: 0xB0 */
  __IO uint32_t RINGO_1;                           /**< offset: 0xB4 */
  __IO uint32_t RINGO_2;                           /**< offset: 0xB8 */
       uint8_t RESERVED_2[4];
  __IO uint32_t FRO_192MHZ;                        /**< offset: 0xC0 */
       uint8_t RESERVED_3[4];
  __IO uint32_t XO_32MHZ;                          /**< offset: 0xC8 */
  __IO uint32_t XO_32KHZ;                          /**< offset: 0xCC */
  __IO uint32_t FRO_1MHZ;                          /**< offset: 0xD0 */
       uint8_t RESERVED_4[4];
  union {                                          /* offset: 0xD8 */
    struct {                                         /* offset: 0xD8 */
      __IO uint32_t DCDC_POWER_PROFILE_HIGH_0;         /**< offset: 0xD8 */
      __IO uint32_t DCDC_POWER_PROFILE_HIGH_1;         /**< offset: 0xDC */
    } DCDC_POWER_PROFILE_HIGH;
    __IO uint32_t DCDC_POWER_PROFILE_HIGH_ARRAY[FLASH_NMPA_DCDC_POWER_PROFILE_HIGH_DCDC_POWER_PROFILE_HIGH_ARRAY_DCDC_POWER_PROFILE_HIGH_ARRAY_COUNT];   /**< array offset: 0xD8, array step: 0x4 */
  };
  union {                                          /* offset: 0xE0 */
    struct {                                         /* offset: 0xE0 */
      __IO uint32_t DCDC_POWER_PROFILE_LOW_0;          /**< offset: 0xE0 */
      __IO uint32_t DCDC_POWER_PROFILE_LOW_1;          /**< offset: 0xE4 */
    } DCDC_POWER_PROFILE_LOW;
    __IO uint32_t DCDC_POWER_PROFILE_LOW_ARRAY[FLASH_NMPA_DCDC_POWER_PROFILE_LOW_DCDC_POWER_PROFILE_LOW_ARRAY_DCDC_POWER_PROFILE_LOW_ARRAY_COUNT];   /**< array offset: 0xE0, array step: 0x4 */
  };
  union {                                          /* offset: 0xE8 */
    struct {                                         /* offset: 0xE8 */
      __IO uint32_t DCDC_POWER_PROFILE_MEDIUM_0;       /**< offset: 0xE8 */
      __IO uint32_t DCDC_POWER_PROFILE_MEDIUM_1;       /**< offset: 0xEC */
    } DCDC_POWER_PROFILE_MEDIUM;
    __IO uint32_t DCDC_POWER_PROFILE_MEDIUM_ARRAY[FLASH_NMPA_DCDC_POWER_PROFILE_MEDIUM_DCDC_POWER_PROFILE_MEDIUM_ARRAY_DCDC_POWER_PROFILE_MEDIUM_ARRAY_COUNT];   /**< array offset: 0xE8, array step: 0x4 */
  };
  __IO uint32_t BOD;                               /**< offset: 0xF0 */
  __IO uint32_t LDO_AO;                            /**< offset: 0xF4 */
  __IO uint32_t SDIO_DELAY;                        /**< offset: 0xF8 */
       uint8_t RESERVED_5[4];
  union {                                          /* offset: 0x100 */
    struct {                                         /* offset: 0x100 */
      __IO uint32_t AUX_BIAS_CURVE_AMBIENT_0;          /**< offset: 0x100 */
      __IO uint32_t AUX_BIAS_CURVE_AMBIENT_1;          /**< offset: 0x104 */
      __IO uint32_t AUX_BIAS_CURVE_AMBIENT_2;          /**< offset: 0x108 */
      __IO uint32_t AUX_BIAS_CURVE_AMBIENT_3;          /**< offset: 0x10C */
    } AUX_BIAS_CURVE_AMBIENT;
    __IO uint32_t AUX_BIAS_CURVE_AMBIENT_ARRAY[FLASH_NMPA_AUX_BIAS_CURVE_AMBIENT_AUX_BIAS_CURVE_AMBIENT_ARRAY_AUX_BIAS_CURVE_AMBIENT_ARRAY_COUNT];   /**< Aux Bias Curve Ambient (30degC), array offset: 0x100, array step: 0x4 */
  };
  union {                                          /* offset: 0x110 */
    struct {                                         /* offset: 0x110 */
      __IO uint32_t AUX_BIAS_CURVE_TEMP_0;             /**< offset: 0x110 */
      __IO uint32_t AUX_BIAS_CURVE_TEMP_1;             /**< offset: 0x114 */
      __IO uint32_t AUX_BIAS_CURVE_TEMP_2;             /**< offset: 0x118 */
      __IO uint32_t AUX_BIAS_CURVE_TEMP_3;             /**< offset: 0x11C */
    } AUX_BIAS_CURVE_TEMP;
    __IO uint32_t AUX_BIAS_CURVE_TEMP_ARRAY[FLASH_NMPA_AUX_BIAS_CURVE_TEMP_AUX_BIAS_CURVE_TEMP_ARRAY_AUX_BIAS_CURVE_TEMP_ARRAY_COUNT];   /**< Aux Bias Curve TEMP (105degC), array offset: 0x110, array step: 0x4 */
  };
  __IO uint32_t TEMP_SENS_VBE1VBE8_REF_1;          /**< offset: 0x120 */
  __IO uint32_t TEMP_SENS_VBE1VBE8_REF_2;          /**< offset: 0x124 */
  __IO uint32_t TEMP_SENS_SLOPE;                   /**< offset: 0x128 */
  __IO uint32_t TEMP_SENS_OFFSET;                  /**< offset: 0x12C */
  union {                                          /* offset: 0x130 */
    struct {                                         /* offset: 0x130 */
      __IO uint32_t PVT_MONITOR_0_RINGO;               /**< offset: 0x130 */
      __IO uint32_t PVT_MONITOR_0_DELAYS_LSB;          /**< offset: 0x134 */
      __IO uint32_t PVT_MONITOR_0_DELAYS_MSB;          /**< offset: 0x138 */
    } PVT_MONITOR_0;
    __IO uint32_t PVT_MONITOR_0_ARRAY[FLASH_NMPA_PVT_MONITOR_0_PVT_MONITOR_0_ARRAY_PVT_MONITOR_0_ARRAY_COUNT];   /**< array offset: 0x130, array step: 0x4 */
  };
       uint8_t RESERVED_6[4];
  union {                                          /* offset: 0x140 */
    struct {                                         /* offset: 0x140 */
      __IO uint32_t PVT_MONITOR_1_RINGO;               /**< offset: 0x140 */
      __IO uint32_t PVT_MONITOR_1_DELAYS_LSB;          /**< offset: 0x144 */
      __IO uint32_t PVT_MONITOR_1_DELAYS_MSB;          /**< offset: 0x148 */
    } PVT_MONITOR_1;
    __IO uint32_t PVT_MONITOR_1_ARRAY[FLASH_NMPA_PVT_MONITOR_1_PVT_MONITOR_1_ARRAY_PVT_MONITOR_1_ARRAY_COUNT];   /**< array offset: 0x140, array step: 0x4 */
  };
  __IO uint32_t NXP_DEVICE_PRIVATE_KEY[FLASH_NMPA_NXP_DEVICE_PRIVATE_KEY_COUNT]; /**< array offset: 0x14C, array step: 0x4 */
  __IO uint32_t NXP_DEVICE_CERTIFICATE_0[FLASH_NMPA_NXP_DEVICE_CERTIFICATE_0_COUNT]; /**< NXP Device Certificate (ECDSA_sign - r[255:128]), array offset: 0x180, array step: 0x4 */
  __IO uint32_t NXP_DEVICE_CERTIFICATE_1[FLASH_NMPA_NXP_DEVICE_CERTIFICATE_1_COUNT]; /**< NXP Device Certificate (ECDSA_sign - r[127:0]), array offset: 0x190, array step: 0x4 */
  __IO uint32_t NXP_DEVICE_CERTIFICATE_2[FLASH_NMPA_NXP_DEVICE_CERTIFICATE_2_COUNT]; /**< NXP Device Certificate (ECDSA_sign - s[255:128]), array offset: 0x1A0, array step: 0x4 */
  __IO uint32_t NXP_DEVICE_CERTIFICATE_3[FLASH_NMPA_NXP_DEVICE_CERTIFICATE_3_COUNT]; /**< NXP Device Certificate (ECDSA_sign - s[127:0]), array offset: 0x1B0, array step: 0x4 */
  __IO uint32_t SHA256_DIGEST[FLASH_NMPA_SHA256_DIGEST_COUNT]; /**< SHA-256 DIGEST (9EC00 - 9FDBC) ROM Patch Area + NXP Area (IMPORTANT NOTE: Pages used for Repair (N-8 to N-3) are excluded from the computation) SHA256_DIGEST0 for DIGEST[31:0]..SHA-256 DIGEST (9EC00 - 9FDBC) ROM Patch Area + NXP Area (IMPORTANT NOTE: Pages used for Repair (N-8 to N-3) are excluded from the computation) SHA256_DIGEST7 for DIGEST[255:224], array offset: 0x1C0, array step: 0x4 */
  union {                                          /* offset: 0x1E0 */
    struct {                                         /* offset: 0x1E0 */
      __IO uint32_t ECID_BACKUP_0;                     /**< offset: 0x1E0 */
      __IO uint32_t ECID_BACKUP_1;                     /**< offset: 0x1E4 */
      __IO uint32_t ECID_BACKUP_2;                     /**< offset: 0x1E8 */
      __IO uint32_t ECID_BACKUP_3;                     /**< offset: 0x1EC */
    } ECID_BACKUP;
    __IO uint32_t ECID_BACKUP_ARRAY[FLASH_NMPA_ECID_BACKUP_ECID_BACKUP_ARRAY_ECID_BACKUP_ARRAY_COUNT];   /**< ECID backup (the original is in page n-1), array offset: 0x1E0, array step: 0x4 */
  };
       uint32_t CHECKSUM[FLASH_NMPA_CHECKSUM_COUNT]; /**< Checksum of the whole page, array offset: 0x1F0, array step: 0x4 */
       uint8_t RESERVED_7[2732];
  __IO uint32_t DIS_ROM_HIDING;                    /**< offset: 0xCAC */
       uint8_t RESERVED_8[12];
  __IO uint32_t PUF_SRAM;                          /**< offset: 0xCBC */
} FLASH_NMPA_Type;

/* ----------------------------------------------------------------------------
   -- FLASH_NMPA Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FLASH_NMPA_Register_Masks FLASH_NMPA Register Masks
 * @{
 */

/*! @name GPO0_0 - GPO0 register 0 description */
/*! @{ */

